//Найти третью цифру числа или сообщить, что её нет
Console.WriteLine("");
Console.Write("Введите число n: ");
int num = int.Parse(Console.ReadLine());
//int num2= num;
  //while (num <= 1000)
   //{
   //  if (num2 <1000)
   //  {
   //    num2 = num2 / 10;
   //  }
  // Console.WriteLine(num); 
  // }
  

